;*******************************************************************************************
;  FILE:   RulersPauseTimers.Localization
;  
;	File created by RustyDios	10/01/20	12:00	
;	LAST UPDATED				14/01/20	23:00
;
;	localization for the passive icon
;
;*******************************************************************************************

[RulersPauseTimersPassive X2AbilityTemplate]
LocFriendlyName="Reality Paradox Temporum"
LocLongDescription="When this unit is revealed to an XCOM unit, time itself will be warped.\nAny mission timers will be paused until this unit dies or flees."
LocHelpText="When this unit is revealed to an XCOM unit, time itself will be warped.\nAny mission timers will be paused until this unit dies or flees."
